Autodesk.Revit.DB.AssemblyDifferenceMemberDifference.MemberDifference
Difference between the assembly members
Since:
2012

Autodesk.Revit.DB.AssemblyDifferenceMemberDifference.MemberId2
Id of the member in the second assembly
Since:
2012

Autodesk.Revit.DB.AssemblyDifferenceMemberDifference.MemberId1
Id of the member in the first assembly
Since:
2012

Autodesk.Revit.DB.AssemblyDifferenceMemberDifference
The two assemblies being compared have different members
Remarks:
This difference means that there is a member of the first assembly which
is different from the corresponding member of the second assembly.
Details about the difference are in memberDifference.
Since:
2012